/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dkaymak <dkaymak@student.42istanbul.com.t  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/04/21 17:41:14 by dkaymak           #+#    #+#             */
/*   Updated: 2025/04/21 17:51:58 by dkaymak          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

void	ft_swap(int *a, int *b);

int	main()
{
	int x = 5;
	int y = 10;
	
	ft_swap(&x, &y);

	printf("%d %d\n", x,  y); //çıktı 10 5 değeri yazdırır.

}



